'use strict'


function NumbString(num)
{
    let a=num%10, b=num%100, c=Math.trunc(num/100),
    X1=['один ','два ','три ','четыре ','пять ','шесть ','семь ','восемь ','девять '],
    X2=['одинадцать ','двенадцать ','тринадцать ','четырнадцать ','пятнадцать ','шестнадцать ','семнадцать ','восемнадцать ','девятнадцать '],
    X3=['десять ','двадцать ','тридцать ','сорок ','пятдесят ','шестьдесят ','семьдесят ','восемьдесят ','девяносто '],
    X4=['сто ','двести ','триста ','четыреста ','пятьсот ','шестьсот ','семьсот ','восемьсот ','девятьсот '], res=' ';
    if(num>=100) 
        res+=X4[c-1];
    if(b>10&&b<20) 
        res=res+X2[b-11];
    else if(b==10||b>19)
    {
        res+=X3[Math.trunc(b/10)-1];
        if(a!=0) res=res+X1[a-1]; 
    }
    else if(b<10)
    {
        if(a!=0)
        res=res+X1[a-1];
    }
    return res;
}
let n=639000693;
let F=['миллиард','миллион','тысяч'], res=' ';
for (let i=0; i<3; i++)
{
    let k=Math.trunc(n/(10**(3*(3-i)))), C, s;
    if (i<2)
        C=['','a ','ов ']
    else
        C=['а','и','']
    if(k>0)
    {
        if(k%10==1) s=0;
        if(k%10>1 && k%10<5) s=1;
        if(k%10>4) s=2;
        if(k%100>10 && k%100<20) s=2;
        if(k%10==0) s=2;
        res+=NumbString(k)+F[i];
        res+=C[s];
        n=n%(10**(3*(3-i)));
    }
    
}
res+=NumbString(n);
console.log(res);